HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/CPU1.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "176pin" --part "F2838x_176pin" --context "CPU1" --product "C2000WARE@5.02.00.00"
 * @versions {"tool":"1.19.0+3426"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const adc4           = adc.addInstance();
const asysctl        = scripting.addModule("/driverlib/asysctl.js");
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const can2           = can.addInstance();
const cla            = scripting.addModule("/driverlib/cla.js", {}, false);
const cla1           = cla.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const epwm4          = epwm.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const gpio5          = gpio.addInstance();
const gpio6          = gpio.addInstance();
const gpio7          = gpio.addInstance();
const gpio8          = gpio.addInstance();
const gpio9          = gpio.addInstance();
const gpio10         = gpio.addInstance();
const gpio11         = gpio.addInstance();
const gpio12         = gpio.addInstance();
const gpio13         = gpio.addInstance();
const gpio14         = gpio.addInstance();
const gpio15         = gpio.addInstance();
const gpio16         = gpio.addInstance();
const gpio17         = gpio.addInstance();
const gpio18         = gpio.addInstance();
const gpio19         = gpio.addInstance();
const gpio20         = gpio.addInstance();
const gpio21         = gpio.addInstance();
const gpio22         = gpio.addInstance();
const gpio23         = gpio.addInstance();
const gpio24         = gpio.addInstance();
const gpio25         = gpio.addInstance();
const gpio26         = gpio.addInstance();
const gpio27         = gpio.addInstance();
const gpio28         = gpio.addInstance();
const gpio29         = gpio.addInstance();
const gpio30         = gpio.addInstance();
const gpio31         = gpio.addInstance();
const gpio32         = gpio.addInstance();
const gpio33         = gpio.addInstance();
const gpio34         = gpio.addInstance();
const gpio35         = gpio.addInstance();
const gpio36         = gpio.addInstance();
const gpio37         = gpio.addInstance();
const gpio38         = gpio.addInstance();
const i2c            = scripting.addModule("/driverlib/i2c.js", {}, false);
const i2c1           = i2c.addInstance();
const ipc            = scripting.addModule("/driverlib/ipc.js");
const memcfg         = scripting.addModule("/driverlib/memcfg.js");
const spi            = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1           = spi.addInstance();
const spi2           = spi.addInstance();
const spi3           = spi.addInstance();
const sync           = scripting.addModule("/driverlib/sync.js");
const sysctl         = scripting.addModule("/driverlib/sysctl.js");
const FREERTOS       = scripting.addModule("/kernel/freertos_tool/FREERTOS", {}, false);
const FREERTOS1      = FREERTOS.addInstance();
const FPUfastRTS     = scripting.addModule("/libraries/math/FPUfastRTS/FPUfastRTS.js", {}, false);
const FPUfastRTS1    = FPUfastRTS.addInstance();
const CMD            = scripting.addModule("/utilities/cmd_tool/cmd_syscfg/source/CMD");
const CMD1           = CMD.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                   = "myADCA";
adc1.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc1.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc1.adcSignalMode           = "ADC_MODE_DIFFERENTIAL";
adc1.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc1.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc0Channel             = "ADC_CH_ADCIN2_ADCIN3";
adc1.soc0Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc1.soc0SampleWindow        = 96;
adc1.soc1Channel             = "ADC_CH_ADCIN4_ADCIN5";
adc1.soc1Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc1.soc1SampleWindow        = 96;
adc1.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc1.enabledInts             = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1        = true;
adc1.interrupt1SOCSource     = "ADC_SOC_NUMBER1";
adc1.registerInterrupts      = ["1"];
adc1.adcInt1.enableInterrupt = true;

adc2.$name                   = "myADCB";
adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc2.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc2.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc2.soc0Channel             = "ADC_CH_ADCIN3";
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc2.soc0SampleWindow        = 96;
adc2.soc1SampleWindow        = 96;
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc2.soc1Channel             = "ADC_CH_ADCIN8";
adc2.soc2Channel             = "ADC_CH_ADCIN2";
adc2.soc2SampleWindow        = 96;
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc2.soc3Channel             = "ADC_CH_ADCIN9";
adc2.soc3Trigger             = "ADC_TRIGGER_EPWM4_SOCA";
adc2.soc3SampleWindow        = 96;
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.enabledInts             = ["ADC_INT_NUMBER1"];
adc2.enableInterrupt1        = true;
adc2.interrupt1SOCSource     = "ADC_SOC_NUMBER3";
adc2.registerInterrupts      = ["1"];
adc2.adcInt1.enableInterrupt = true;

