HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/CPU1.syscfg
epwm4.$name                                                      = "FO_HB_2";
epwm4.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_period                                        = 25000;
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm4.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm4.epwmCounterCompare_cmpA                                    = 1000;
epwm4.epwmCounterCompare_cmpB                                    = 1000;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_delayRED                                      = 560;
epwm4.epwmDeadband_delayFED                                      = 520;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                      = "EPWM_TZ_ACTION_LOW";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                      = "EPWM_TZ_ACTION_HIGH";
epwm4.epwmTripZone_oneShotSource                                 = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm4.epwmEventTrigger_enableInterrupt                           = true;
epwm4.epwmEventTrigger_registerInterrupts                        = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "1";
epwm4.useCase                                                    = "CUSTOM";
epwm4.epwmInt.enableInterrupt                                    = true;
epwm4.epwm.$assign                                               = "EPWM8";

gpio1.$name             = "LED1";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.gpioPin.$assign   = "GPIO9";

gpio2.$name             = "LED2";
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.controllerCore    = "GPIO_CORE_CPU2";
gpio2.writeInitialValue = true;
gpio2.initialValue      = 1;
gpio2.gpioPin.$assign   = "GPIO8";

gpio3.$name             = "LED3";
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.initialValue      = 1;
gpio3.controllerCore    = "GPIO_CORE_CM";
gpio3.gpioPin.$assign   = "GPIO99";

gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.$name             = "LED4";
gpio4.gpioPin.$assign   = "GPIO21";

gpio5.$name             = "RTD_CSA";
gpio5.direction         = "GPIO_DIR_MODE_OUT";
gpio5.writeInitialValue = true;
gpio5.initialValue      = 1;
gpio5.gpioPin.$assign   = "GPIO35";

gpio6.$name             = "RTD_CSB";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO48";

gpio7.$name             = "RTD_MUX_A0";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.gpioPin.$assign   = "GPIO30";

gpio8.$name             = "RTD_MUX_A1";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.gpioPin.$assign   = "GPIO28";

gpio9.$name             = "RTD_MUX_B0";
gpio9.direction         = "GPIO_DIR_MODE_OUT";
gpio9.writeInitialValue = true;
gpio9.gpioPin.$assign   = "GPIO29";

gpio10.$name             = "RTD_MUX_B1";
gpio10.direction         = "GPIO_DIR_MODE_OUT";
gpio10.writeInitialValue = true;
gpio10.gpioPin.$assign   = "GPIO31";

gpio11.$name           = "RTD_DRDYA";
gpio11.gpioPin.$assign = "GPIO40";

gpio12.$name           = "RTD_DRDYB";
gpio12.gpioPin.$assign = "GPIO41";

gpio13.$name             = "GD_EN1";
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.writeInitialValue = true;
gpio13.gpioPin.$assign   = "GPIO89";

gpio14.$name           = "GD_EN2";
gpio14.direction       = "GPIO_DIR_MODE_OUT";
gpio14.gpioPin.$assign = "GPIO88";

gpio15.$name           = "ERROR_OUT1";
gpio15.gpioPin.$assign = "GPIO17";

gpio16.$name           = "ERROR_OUT2";
gpio16.gpioPin.$assign = "GPIO27";

gpio17.$name           = "HALT1";
gpio17.gpioPin.$assign = "GPIO43";

gpio18.$name           = "HALT2";
gpio18.gpioPin.$assign = "GPIO67";

gpio19.$name           = "HALT1_N";
gpio19.gpioPin.$assign = "GPIO47";

gpio20.$name           = "HALT2_N";
gpio20.gpioPin.$assign = "GPIO42";

gpio21.$name           = "STOP1";
gpio21.direction       = "GPIO_DIR_MODE_OUT";
gpio21.gpioPin.$assign = "GPIO46";

gpio22.$name           = "STOP2";
gpio22.direction       = "GPIO_DIR_MODE_OUT";
gpio22.gpioPin.$assign = "GPIO133";

gpio23.$name             = "HSD1";
gpio23.direction         = "GPIO_DIR_MODE_OUT";
gpio23.writeInitialValue = true;
gpio23.gpioPin.$assign   = "GPIO53";

gpio24.$name             = "HSD2";
gpio24.direction         = "GPIO_DIR_MODE_OUT";
gpio24.writeInitialValue = true;
gpio24.gpioPin.$assign   = "GPIO52";

gpio25.$name             = "HSD3";
gpio25.direction         = "GPIO_DIR_MODE_OUT";
gpio25.writeInitialValue = true;
gpio25.gpioPin.$assign   = "GPIO51";

gpio26.$name             = "HSD4";
gpio26.direction         = "GPIO_DIR_MODE_OUT";
gpio26.writeInitialValue = true;
gpio26.gpioPin.$assign   = "GPIO49";

gpio27.$name           = "HSD_ST_1_2";
gpio27.gpioPin.$assign = "GPIO54";

gpio28.$name           = "HSD_ST_3_4";
gpio28.gpioPin.$assign = "GPIO50";

gpio29.$name           = "CARD_DETECT";
gpio29.gpioPin.$assign = "GPIO74";

gpio30.$name             = "S_CAN1";
gpio30.direction         = "GPIO_DIR_MODE_OUT";
gpio30.controllerCore    = "GPIO_CORE_CM";
gpio30.writeInitialValue = true;
gpio30.gpioPin.$assign   = "GPIO45";

gpio31.$name           = "S_CAN2";
gpio31.direction       = "GPIO_DIR_MODE_OUT";
gpio31.gpioPin.$assign = "GPIO44";

gpio32.$name             = "S_CAN3";
gpio32.direction         = "GPIO_DIR_MODE_OUT";
gpio32.controllerCore    = "GPIO_CORE_CM";
gpio32.writeInitialValue = true;
gpio32.initialValue      = 1;
gpio32.gpioPin.$assign   = "GPIO66";

gpio33.$name           = "RTC_INT";
gpio33.gpioPin.$assign = "GPIO2";

gpio34.$name           = "SBC_INTB";
gpio34.gpioPin.$assign = "GPIO55";

gpio35.$name           = "SBC_FS0B";
gpio35.gpioPin.$assign = "GPIO64";

